brbeardm/PelletPirate/esp_breadboard_test_fw/sdkconfig.defaults
# ESP32-S3-WROOM-1U-N16R8: 16MB quad flash, 8MB octal PSRAM
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# Console over the on-die USB-Serial-JTAG (the USB-C port)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
